define([], function() {
    var dict = {
        hotelOrderStatus: {
            "1": "待支付",
            "2": "已支付",
            "3": "已入住",
            "4": "已退房",
            "5": "已完成",
            "6": "待退款",
            "7": "退款成功",
            "8": "退款失败",
            "9": "已申请退款",
            "91": "用户异常",
            "92": "商户异常"
        },
        lineOrderStatus: {
            "1": "待支付",
            "2": "已支付",
            "5": "已完成",
            "6": "待退款",
            "7": "退款成功",
            "8": "退款失败",
            "9": "已申请退款",
            "91": "用户异常",
            "92": "商户异常"
        },
        travelNoteStatus: {
            "0": "待审核",
            "1": "审核通过",
            "2": "审核不通过"
        },
        commentStatus: {
            "0": "用户发布未审核", 
            "1": "通过",
            "2": "不通过"
        }
    };

    return {
        get: function(code) {
            return dict[code];
        }
    }
});