define([], function() {
    var dict = {
        // 酒店订单
        hotelOrderStatus: {
            "1": "待支付",
            "2": "已支付",
            "3": "已入住",
            "4": "已退房",
            "5": "已完成",
            "6": "待退款",
            "7": "退款成功",
            "8": "退款失败",
            "9": "已申请退款",
            "91": "用户异常",
            "92": "商户异常"
        },
        // 线路订单
        lineOrderStatus: {
            "1": "待支付",
            "2": "已支付",
            "5": "已完成",
            "6": "待退款",
            "7": "退款成功",
            "8": "退款失败",
            "9": "已申请退款",
            "91": "用户异常",
            "92": "商户异常"
        },
        // 专线订单
        specialLineOrderStatus: {
            "1": "待支付",
            "2": "已支付",
            "3": "已完成",
            "4": "待退款",
            "5": "退款成功",
            "6": "退款失败",
            "7": "已申请退款",
            "8": "已取消",
            "91": "用户异常",
            "92": "商户异常"
        },
        // 大巴订单
        busStatus: {
            "0": "待支付",
            "1": "已支付",
            "2": "已接单",
            "3": "已完成",
            "4": "待退款",
            "5": "退款成功",
            "6": "退款失败",
            "7": "取消订单",
            "91": "用户异常",
            "92": "商户异常"
        },
        // 拼车订单
        carpoolStatus: {
            "0": "待支付",
            "1": "首款已支付",
            "2": "待支付尾款",
            "3": "已支付",
            "4": "已完成",
            "91": "用户异常",
            "92": "商户异常",
            "0123": "已经参与拼车的状态集合"
        },
        // 商品订单
        commodityStatus: {
            "1": "待支付",
            "2": "已支付",
            "3": "已发货",
            "4": "已收货",
            "91": "用户异常",
            "92": "商户异常",
            "93": "快递异常"
        },
        // 游记状态
        travelNoteStatus: {
            "0": "待审核",
            "1": "审核通过",
            "2": "审核不通过"
        },
        // 评论状态
        commentStatus: {
            "0": "用户发布未审核", 
            "1": "通过",
            "2": "不通过"
        }
    };

    return {
        get: function(code) {
            return dict[code];
        }
    }
});